# YOLO11 extra-large model
nc: 4  # number of classes

# Scale parameters
depth_multiple: 1.00
width_multiple: 1.50
max_channels: 512

# Backbone
backbone:
  - [-1, 1, Conv, [96, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [192, 3, 2]]       # 1-P2/4
  - [-1, 2, C3k2, [384, False, 1.50]]
  - [-1, 1, Conv, [384, 3, 2]]       # 3-P3/8
  - [-1, 2, C3k2, [768, False, 1.50]]
  - [-1, 1, Conv, [768, 3, 2]]       # 5-P4/16
  - [-1, 2, C3k2, [768, True]]
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]         # 9
  - [-1, 2, C2PSA, [1024]]           # 10

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [768, False]]      # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [384, False]]      # 16 (P3/8-small)

  - [-1, 1, Conv, [384, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [768, False]]      # 19 (P4/16-medium)

  - [-1, 1, Conv, [768, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]      # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)
